``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.gpunodealpha will be updated in-place
  ~ resource "aws_route53_record" "gpunodealpha" {
        id              = "Z386N8B8JBC6TQ_gpu-node-alpha.galaxyproject.eu_A"
        name            = "gpu-node-alpha.galaxyproject.eu"
      ~ records         = [
          - "192.52.44.60",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.gpu-node-alpha will be created
  + resource "openstack_compute_instance_v2" "gpu-node-alpha" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "g1.c8m100g1d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "gpu-node-alpha.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
        ]
      + stop_before_destroy = false
      + user_data           = "7635600ffa9c40149258b94fc51daf72ef79af76"

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "5f3fc2b3-0803-44cc-abe5-40335a6e6bd6"
          + volume_size           = 200
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.gpu-node-alpha-internal-va will be created
  + resource "openstack_compute_volume_attach_v2" "gpu-node-alpha-internal-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = "f36ad02f-dfe4-4bc6-9ea1-6e56344bbcbc"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```